Revit 2026 API
ExporterIFCUtils.SetGlobal2DOriginHandle Method
 Sets the handle representing the 2D origin.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static void SetGlobal2DOriginHandle(
	IFCAnyHandle origin
)
Public Shared Sub SetGlobal2DOriginHandle (
	origin As IFCAnyHandle
)
public:
static void SetGlobal2DOriginHandle(
	IFCAnyHandle^ origin
)
static member SetGlobal2DOriginHandle :
        origin : IFCAnyHandle -> unit
Parameters
origin IFCAnyHandle
 The origin handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace